Revit 2027 API
PDFExportOptions.Combine Property
 Whether export all views and sheets into one PDF file or multiple files.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public bool Combine { get; set; }
Public Property Combine As Boolean
	Get
	Set
public:
property bool Combine {
	bool get ();
	void set (bool value);
}
member Combine : bool with get, set
Property Value
Boolean
Remarks
 If true, all exported views and sheets will be exported into one PDF file, whose file name would be specified by FileName. If false, each exported view and sheet will have its own PDF file created, whose file name would be generated with [!:NamingRule].
See Also
Reference
PDFExportOptions Class
Autodesk.Revit.DB Namespace